[
    {
        "id": "google-data-analytics-professional-certificate",
        "certificatePictures": [
            "google-data-analytics-professional-certificate-v2.webp"
        ],
        "certificateTitle": "Google Data Analytics Professional Certificate",
        "certificateSite": "https://www.credly.com/badges/4ce028b3-daec-457d-a607-631fb74b5e1e",
        "certificateTime": "April 2024",
        "certificateAwarder": "Google",
        "certificateDescription": "Completed comprehensive 8-course program covering end-to-end data analytics processes including data preparation, transformation, analysis, visualization, and strategic insights presentation. Developed advanced proficiency in SQL, R programming, and Tableau for enterprise-grade analytics solutions.",
        "certificateActivities": [
            "Implemented advanced data cleaning techniques and statistical analysis methodologies",
            "Engineered complex SQL queries for efficient data extraction and transformation",
            "Developed statistical models and data pipelines using R programming",
            "Designed executive-level dashboards and visualizations for data-driven decision making"
        ]
    },
    {
        "id": "ccs-days-2025-hackathon-overall-champion",
        "certificatePictures": [
            "overall-champion.webp",
            "hackathon-champion.webp",
            "hackathon-best-innovative-solution.webp"
        ],
        "certificateTitle": "CCS Days 2025 Hackathon",
        "certificateTime": "March 2025",
        "certificateAwarder": "USPF College of Computer Studies",
        "certificateDescription": "Led the development of TESTify, an AI-powered exam integrity platform integrated with Canvas LMS that leverages computer vision and machine learning to detect academic dishonesty through facial recognition and behavioral pattern analysis, securing the Overall Champion award.",
        "certificateActivities": [
            "Awarded Hackathon Champion for technical excellence and solution completeness",
            "Recognized with Best Innovative Solution for pioneering AI-based proctoring technology"
        ]
    },
    {
        "id": "ccs-days-2023-hackathon-overall-champion",
        "certificatePictures": [
            "champion-of-hackathon-ccs-days-2023.webp",
            "hackathon-most-promising-innovation-ccs-days-2023.webp",
            "hackathon-best-in-logo-ccs-days-2023.webp"
        ],
        "certificateTitle": "CCS Days 2023 Hackathon",
        "certificateTime": "December 2023",
        "certificateAwarder": "USPF College of Computer Studies",
        "certificateDescription": "Built CERTify, an authentication system that implements blockchain-inspired verification, AI-powered forgery detection, and cryptographic security to ensure document integrity for academic credentials.",
        "certificateActivities": [
            "Awarded Champion of the Hackathon for the 1st year-3rd year category",
            "Awarded Most Promising Innovation for market-ready solution addressing real-world credential verification challenges",
            "Recognized for brand identity excellence with Best-in-Logo award"
        ]
    },
    {
        "id": "tcs-empowers-goit-2021",
        "certificatePictures": [
            "tcs-empowers-goit-2021.webp"
        ],
        "certificateTitle": "goIT 3rd Place",
        "certificateTime": "November 2021",
        "certificateAwarder": "TCS Digital Innovation Program",
        "certificateDescription": "Developed a scalable COVID-19 contact tracing platform as technical lead for TrackTrace, securing 3rd place recognition in the TCS Digital Innovation Program competition against teams from across Capiz Province.",
        "certificateActivities": [
            "Designed and implemented full-stack contact tracing solution with geolocation and exposure notification system"
        ]
    }
]