[
    {
        "id": "xFusion",
        "jobPicture": "xfusion.webp",
        "jobColor": "#10214c",
        "jobTitle": "Full Stack AI Engineer",
        "jobTime": "August 2024 - March 2025",
        "jobCompany": "xFusion",
        "jobCompanySite": "https://xfusion.io/",
        "jobActivities": [
            "Built multi-agent AI responder system with Python, OpenAI, LangChain/LangGraph using RAG techniques, improving response accuracy by 65% and cutting manual drafting time by 75%.",
            "Developed intelligent CSM inbox system with Next.js, TypeScript, Node.js integrating Gmail, Slack, and Fireflies, reducing communication management time by 40% and enabling focus on high-value customer interactions.",
            "Designed serverless architecture on AWS Lambda using Node.js, TypeScript, and Python that scaled to handle 3x the original request volume while reducing infrastructure costs by 20%.",
            "Optimized AI task management workflow with Linear API connecting support communications across platforms, resulting in 30% faster ticket resolution and 25% higher customer satisfaction scores.",
            "Implemented ETL data pipelines with Snowflake, PostgreSQL, DynamoDB, and Pinecone vector databases, improving AI agent performance by 45% through optimized data processing.",
            "Mentored junior developers on AI agent development, establishing code standards that reduced bug rates by 35% while leveraging AI tools (Cursor IDE, io.Dev) to boost team productivity.",
            "Prototyped automated customer onboarding system that became foundation for company's AI workflow builder platform (similar to Zapier/Make.com)."
        ],
        "jobTechnologies": [
            {
                "name": "Python",
                "icon": "python"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "Node.js",
                "icon": "node"
            },
            {
                "name": "AWS",
                "icon": "aws"
            },
            {
                "name": "Serverless",
                "icon": "serverless"
            },
            {
                "name": "LangChain/LangGraph/LangSmith",
                "icon": "langchain"
            }
        ]
    },
    {
        "id": "bilis-delivery",
        "jobPicture": "developkreativity.webp",
        "jobColor": "#006fff",
        "jobTitle": "Lead Full Stack Developer",
        "jobTime": "April 2024 - Present",
        "jobCompany": "Bilis Delivery",
        "jobCompanySite": "https://developkreativity.com/",
        "jobActivities": [
            "Built food delivery platform using Laravel backend and Flutter for mobile/web frontend that processed 10,000+ orders for 2,000+ active users with 99.9% uptime in the first year.",
            "Implemented real-time order tracking and notification system using WebSockets and Google Maps API, enabling customers to monitor deliveries with high accuracy.",
            "Integrated secure payment processing with multiple gateways (Credit Card, COD) and developed automated driver matching algorithm based on proximity and availability.",
            "Created scalable backend with database optimization for consistent transaction handling, maintaining 99.9% uptime while processing 100+ concurrent orders during peak hours.",
            "Designed role-based authentication system providing granular permission controls for customers, drivers, restaurant owners, and admins.",
            "Created modular backend services for order management, driver assignment, and payment processing."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "Laravel",
                "icon": "laravel"
            },
            {
                "name": "Flutter",
                "icon": "flutter"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "Firebase",
                "icon": "firebase"
            },
            {
                "name": "Google Maps API",
                "icon": "google"
            }
        ]
    },
    {
        "id": "develop-kreativity",
        "jobPicture": "developkreativity.webp",
        "jobColor": "#006fff",
        "jobTitle": "Co-Founder & Project Lead",
        "jobTime": "November 2023 - Present",
        "jobCompany": "Develop Kreativity",
        "jobCompanySite": "https://developkreativity.com/",
        "jobActivities": [
            "Redesigned Lyons Global™ learning management system with interactive modules and approval-based registration using WordPress, reducing onboarding time by 60% and increasing user engagement by 45%.",
            "Redesigned Lyons Global™ corporate website on WordPress, implementing responsive design patterns and optimizing performance scores from 65 to 95 on PageSpeed Insights."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "WordPress",
                "icon": "wordpress"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "HTML",
                "icon": "html"
            },
            {
                "name": "CSS",
                "icon": "css"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "Figma",
                "icon": "figma"
            }
        ]
    },
    {
        "id": "university-of-southern-philippines-foundation",
        "jobPicture": "uspf.webp",
        "jobColor": "#27235e",
        "jobTitle": "Full Stack Developer",
        "jobTime": "July 2023 - Present",
        "jobCompany": "University of Southern Philippines Foundation",
        "jobCompanySite": "https://uspf.edu.ph/",
        "jobActivities": [
            "Built AI chat agent with Python, OpenAI, and RAG techniques using ChromaDB vector database, achieving 85% query resolution accuracy and reducing staff support requests by 40%.",
            "Designed distributed university platform on CodeIgniter 4 with Ionic Framework frontend, implementing real-time RFID tracking system, secure digital ID verification, and integrated financial management, improving service access by 35%.",
            "Created queuing management system using Laravel and Vue.js, decreasing wait times by 80% across university service offices.",
            "Optimized PowerEdge R440 server architecture and built internal document records system on Laravel with role-based access control, improving inter-departmental workflow efficiency by 60%."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "CodeIgniter",
                "icon": "codeigniter"
            },
            {
                "name": "Laravel",
                "icon": "laravel"
            },
            {
                "name": "Vue.js",
                "icon": "vue"
            },
            {
                "name": "Ionic",
                "icon": "ionic"
            },
            {
                "name": "Python",
                "icon": "python"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "AWS",
                "icon": "aws"
            }
        ]
    },
    {
        "id": "mytoolz",
        "jobPicture": "mytoolz.webp",
        "jobColor": "#0086eb",
        "jobTitle": "Back End Developer",
        "jobTime": "July 2021 - December 2021",
        "jobCompany": "MyToolz.net",
        "jobCompanySite": "https://mytoolz.net/tools/",
        "jobActivities": [
            "Refactored and optimized high-traffic Blogger website using JavaScript and PHP, implementing security measures that prevented link bypassing and improved platform integrity.",
            "Developed modular PHP-based web tools including proxy validation services, email provider filters, cryptocurrency balance checker, and verification systems that streamlined third-party API integrations.",
            "Designed and deployed security-focused backend APIs using PHP that improved validation process speed and enhanced overall platform reliability."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "HTML",
                "icon": "html"
            },
            {
                "name": "CSS",
                "icon": "css"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "jQuery",
                "icon": "jquery"
            }
        ]
    }
]
