[
    {
        "id": "xFusion",
        "jobPicture": "xfusion.webp",
        "jobColor": "#10214c",
        "jobTitle": "Full Stack AI Engineer",
        "jobTime": "August 2024 - March 2025",
        "jobCompany": "xFusion",
        "jobCompanySite": "https://xfusion.io/",
        "jobDescription": "Remote / Cebu City, PH – On-site per client requirement",
        "jobActivities": [
            "Architected and implemented a multi-agent AI responder system with Python, OpenAI, LangChain/LangGraph, and Pydantic using RAG techniques that improved response accuracy by 65% while reducing manual drafting time by 75%.",
            "Led the development of an intelligent CSM inbox system using Next.js, TypeScript, and Node.js with Gmail, Slack, and Fireflies integration that reduced time spent on email/communication management by 40%, allowing CSMs to focus on high-value customer interactions.",
            "Engineered serverless AI agent architecture on AWS Lambda with Node.js, TypeScript, and Python that scaled to handle 3x the original request volume while reducing infrastructure costs by 20%.",
            "Optimized AI task management workflow integrating Linear API for customer support communications across Gmail, Slack, and Fireflies, resulting in 30% faster ticket resolution and 25% improvement in customer satisfaction scores.",
            "Designed and implemented ETL data pipelines using Snowflake, PostgreSQL, DynamoDB, and Pinecone vector databases that improved AI agent performance by 45% through more efficient data processing and model interaction.",
            "Guided two junior developers on AI agent development best practices, establishing code standards that reduced bug rates by 35% across team while utilizing AI-driven development tools like Cursor IDE, GitHub Copilot, and Devin to increase team productivity.",
            "Developed a prototype for an automated customer onboarding system that directly influenced the creation of the company's AI workflow builder platform, like Zapier and Make.com."
        ],
        "jobTechnologies": [
            {
                "name": "Python",
                "icon": "python"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "Node.js",
                "icon": "node"
            },
            {
                "name": "AWS",
                "icon": "aws"
            },
            {
                "name": "Serverless",
                "icon": "serverless"
            },
            {
                "name": "LangChain",
                "icon": "langchain"
            }
        ]
    },
    {
        "id": "develop-kreativity",
        "jobPicture": "developkreativity.webp",
        "jobColor": "#006fff",
        "jobTitle": "Co-Founder and Project Lead",
        "jobTime": "November 2023 - Present",
        "jobCompany": "Develop Kreativity",
        "jobCompanySite": "https://developkreativity.com/",
        "jobDescription": "Remote / Cebu City, PH",
        "jobActivities": [
            "Led redesign and development of an internal learning management system for Lyons Global™, integrating interactive modules and approval-based user registration using WordPress, cutting onboarding time by 60% and boosting engagement by 45%.",
            "Single-handedly developed and deployed Bilis Delivery, a full-stack food delivery platform using Laravel and Flutter with real-time GPS tracking and automated order management—processed 10,000+ orders in 1 year with 2000+ active users.",
            "Led the redesign and development of a website for Lyons Global™ using WordPress replacing the old Lyons Global™ website, improving brand presence."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "CodeIgniter",
                "icon": "codeigniter"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "HTML",
                "icon": "html"
            },
            {
                "name": "CSS",
                "icon": "css"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "WordPress",
                "icon": "wordpress"
            },
            {
                "name": "Figma",
                "icon": "figma"
            },
            {
                "name": "cPanel",
                "icon": "cpanel"
            }
        ]
    },
    {
        "id": "university-of-southern-philippines-foundation",
        "jobPicture": "uspf.webp",
        "jobColor": "#27235e",
        "jobTitle": "Full Stack Developer",
        "jobTime": "July 2023 - Present",
        "jobCompany": "Information and Communications Technology Department at University of Southern Philippines Foundation",
        "jobCompanySite": "https://uspf.edu.ph/",
        "jobDescription": "Cebu City, PH",
        "jobActivities": [
            "Architected and deployed an AI chat agent using Python, OpenAI, AWS, LangChain/LangGraph, and RAG techniques with ChromaDB vector database, improving query resolution accuracy by 85% and reducing staff support requests by 40%.",
            "Developed an all-in-one university platform using CodeIgniter 4 and Ionic Framework that integrated RFID tracking, digital ID verification, messaging systems, and financial management, improving student/parent/faculty service access by 35%.",
            "Deployed a queuing management system using Laravel and Vue.js that decreased average wait times by 80% across university service offices.",
            "Configured and optimized PowerEdge R440 server environment and deployed an internal document records management system built on Laravel, enabling protected document storage, sharing, and retrieval that improved inter-departmental workflow efficiency by 60%."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "CodeIgniter",
                "icon": "codeigniter"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "HTML",
                "icon": "html"
            },
            {
                "name": "CSS",
                "icon": "css"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "Bootstrap",
                "icon": "bootstrap"
            },
            {
                "name": "jQuery",
                "icon": "jquery"
            },
            {
                "name": "cPanel",
                "icon": "cpanel"
            },
            {
                "name": "AWS",
                "icon": "aws"
            },
            {
                "name": "Git",
                "icon": "git"
            }
        ]
    },
    {
        "id": "mytoolz",
        "jobPicture": "mytoolz.webp",
        "jobColor": "#0086eb",
        "jobTitle": "Back End Developer",
        "jobTime": "July 2021 - December 2021",
        "jobCompany": "MyToolz.net",
        "jobCompanySite": "https://mytoolz.net/tools/",
        "jobDescription": "Remote",
        "jobActivities": [
            "Refactored and optimized high-traffic Blogger website using JavaScript and PHP, implementing security measures that prevented link bypassing and improved platform integrity.",
            "Developed modular PHP-based web tools including proxy validation services, email provider filters, cryptocurrency balance checker, and verification systems that streamlined third-party API integrations.",
            "Designed and deployed security-focused backend APIs using PHP that improved validation process speed and enhanced overall platform reliability."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "HTML",
                "icon": "html"
            },
            {
                "name": "CSS",
                "icon": "css"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "jQuery",
                "icon": "jquery"
            }
        ]
    }
]
