[
    {
        "id": "xFusion",
        "jobPicture": "xfusion.webp",
        "jobColor": "#10214c",
        "jobTitle": "Full Stack AI Engineer",
        "jobTime": "August 2024 - March 2025",
        "jobCompany": "xFusion",
        "jobCompanySite": "https://xfusion.io",
        "jobActivities": [
            "Developed a multi-agent AI responder system that generates contextual replies from multiple sources, boosting response accuracy by 65% and reducing drafting time by 75%.",
            "Implemented prompt engineering, evaluation metrics, and agentic decision logic improving AI agent performance.",
            "Built an AI-powered inbox with a responder agent that filters low-priority messages across platforms, reducing management time by 40% by enabling users to handle all communications in one place.",
            "Re-architected the serverless stack to auto-scale with concurrent, queue-based processing, enabling it to handle 3x the original request volume.",
            "Optimized serverless code execution, resource allocation and third-party calls, cutting infrastructure costs by 20%.",
            "Integrated an AI agent with Linear's API to automate 80% of task management, reducing manual workload by 30% and raising ticket resolution speed and customer satisfaction by 25%.",
            "Developed parallel ETL pipelines that support batch and concurrent processing of emails, messages, and transcripts.",
            "Optimized data flow to minimize errors and prevent data loss, boosting AI-agent performance and reliability by 45%.",
            "Mentored junior developers through onboarding, task guidance, and ongoing support, reducing bugs by 35%.",
            "Introduced and leveraged AI development tools to accelerate individual and team productivity, enabling faster task completion and higher daily progress.",
            "Prototyped an automated customer-onboarding system that tracked progress and engaged customers through CSM accounts by sending weekly checkpoints and follow-ups.",
            "Helped lay the foundation for the company's no-code AI workflow builder, enabling non-technical users to create custom automations and agents through a visual, node-based interface."
        ],
        "jobTechnologies": [
            {
                "name": "Python",
                "icon": "python"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "Node.js",
                "icon": "node"
            },
            {
                "name": "AWS",
                "icon": "aws"
            },
            {
                "name": "Serverless",
                "icon": "serverless"
            },
            {
                "name": "LangChain/LangGraph/LangSmith",
                "icon": "langchain"
            }
        ]
    },
    {
        "id": "bilis-delivery",
        "jobPicture": "developkreativity.webp",
        "jobColor": "#006fff",
        "jobTitle": "Lead Full Stack Developer",
        "jobTime": "April 2024 - Present",
        "jobCompany": "Bilis Delivery",
        "jobCompanySite": "https://developkreativity.com",
        "jobActivities": [
            "Built a food-delivery platform that processed 10,000+ orders from 2,000+ users in its first year, leveraging Laravel queues and Redis for asynchronous workloads while maintaining 99.9% uptime at peak traffic.",
            "Added real-time order tracking and notifications via WebSockets and the Google Maps API, enabling customers to monitor deliveries through push, SMS, in-app, and email alerts.",
            "Integrated COD, credit-card, and in-app-wallet payments with secure transactions using Laravel Passport and OTP verification.",
            "Created a zone-based driver-matching algorithm that filters drivers by location, vehicle compatibility, and live availability, accelerating driver assignment by 80%.",
            "Scaled the backend by optimizing queries, adding indexes, and caching hot data in Redis, significantly reducing page-load times.",
            "Employed batch processing, atomic transactions, and efficient upsert operations to handle 100+ concurrent orders during peak hours.",
            "Designed a multi-guard authentication scheme with Laravel Passport and custom session-based guards for customers, drivers, vendors, and admins.",
            "Implemented granular, module-level RBAC, with roles and permissions defined through JSON-configured modules in the database.",
            "Structured the backend as a modular monolith using service interfaces and the nwidart/laravel-modules package to encapsulate business logic."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "Laravel",
                "icon": "laravel"
            },
            {
                "name": "Flutter",
                "icon": "flutter"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "Firebase",
                "icon": "firebase"
            },
            {
                "name": "Google Maps API",
                "icon": "google"
            }
        ]
    },
    {
        "id": "develop-kreativity",
        "jobPicture": "developkreativity.webp",
        "jobColor": "#006fff",
        "jobTitle": "Co-Founder & Project Lead",
        "jobTime": "November 2023 - Present",
        "jobCompany": "Develop Kreativity",
        "jobCompanySite": "https://developkreativity.com",
        "jobActivities": [
            "Revamped Lyons Global™'s learning-management system by migrating to modern WordPress and adding interactive modules with Tutor LMS and Restrict Content Pro.",
            "Implemented approval-based registration, quizzes, activities, and checkpoints in the LMS, cutting onboarding time by 60% and boosting user engagement by 45%.",
            "Redesigned Lyons Global™'s website, overhauling the UI/UX from Figma wireframes and enabling rapid iterations for faster development.",
            "Built custom components in Elementor Pro—including a bespoke header and footer—and created custom post types for publications.",
            "Optimized Lyons Global™'s site performance with responsive design and streamlined content management, raising the PageSpeed Insights score from 65 to 92."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "WordPress",
                "icon": "wordpress"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "HTML",
                "icon": "html"
            },
            {
                "name": "CSS",
                "icon": "css"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "Figma",
                "icon": "figma"
            }
        ]
    },
    {
        "id": "university-of-southern-philippines-foundation",
        "jobPicture": "uspf.webp",
        "jobColor": "#27235e",
        "jobTitle": "Full Stack Developer",
        "jobTime": "July 2023 - Present",
        "jobCompany": "University of Southern Philippines Foundation",
        "jobCompanySite": "https://uspf.edu.ph",
        "jobActivities": [
            "Developed a multi-agent AI chat system using a state-graph pipeline that delivers automated, context-aware responses, achieving 85% query-resolution accuracy and reducing support requests by 40%.",
            "Built a university app that boosted service access by 35% by integrating digital ID/RFID tracking, statement-of-account retrieval from Pinnacle, and online payments through UnionBank and MLhuillier.",
            "Reduced average wait times at university service offices by 80% by developing a queuing management system that replaced manual queues.",
            "Upgraded a PowerEdge R440 server and locally deployed a document-records management system, eliminating manual storage and sharing and improving inter-departmental workflow by 60%."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "CodeIgniter",
                "icon": "codeigniter"
            },
            {
                "name": "Laravel",
                "icon": "laravel"
            },
            {
                "name": "Vue.js",
                "icon": "vue"
            },
            {
                "name": "Ionic",
                "icon": "ionic"
            },
            {
                "name": "Python",
                "icon": "python"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "AWS",
                "icon": "aws"
            }
        ]
    },
    {
        "id": "mytoolz",
        "jobPicture": "mytoolz.webp",
        "jobColor": "#0086eb",
        "jobTitle": "Back End Developer",
        "jobTime": "July 2021 - December 2021",
        "jobCompany": "MyToolz",
        "jobCompanySite": "https://mytoolz.net/tools",
        "jobActivities": [
            "Improved a high-traffic Blogger-based link locker by using an externally hosted API endpoint to securely handle URL masking using server-side encryption and database ID mapping, replacing insecure client-side base64 masking.",
            "Integrated strict referrer validation to ensure only legitimate requests from the Blogger site could access protected content, resulting in a 70% reduction in content theft.",
            "Developed a PHP-based API toolkit as a collection of custom tools, including proxy validation (via cURL and provider APIs), email validation and filtering with regex, cryptocurrency balance checks, and account verification.",
            "Migrated core validation and utility features from third-party APIs to in-house solutions, reducing external API calls by 40% and improving system reliability."
        ],
        "jobTechnologies": [
            {
                "name": "PHP",
                "icon": "php"
            },
            {
                "name": "JavaScript",
                "icon": "javascript"
            },
            {
                "name": "HTML",
                "icon": "html"
            },
            {
                "name": "CSS",
                "icon": "css"
            },
            {
                "name": "MySQL",
                "icon": "mysql"
            },
            {
                "name": "jQuery",
                "icon": "jquery"
            }
        ]
    }
]
